       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
          SPECIAL-NAMES.
             DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 Numero1 PIC S99V99 VALUE 10,55.
           01 Numero2 PIC S99V99 VALUE 65,20.

           01 Resultado PIC S99V99 VALUE ZERO.
       PROCEDURE DIVISION.
       MuestraResultado.
          COMPUTE Resultado = Numero1 - Numero2.
          DISPLAY Resultado.
       STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
