       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       Parrafo1.
           DISPLAY "Estás en el parrafo 1".
           PERFORM Parrafo3.
       Parrafo2.
           DISPLAY "Estás en el parrafo 2".
           DISPLAY "Aquí acaba el viaje".
           STOP RUN.
       Parrafo3.
           DISPLAY "Estás en el parrafo 3".

       END PROGRAM YOUR-PROGRAM-NAME.
