       IDENTIFICATION DIVISION.
       PROGRAM-ID. Tesst.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 NUMERO1 PIC 999 VALUE 15.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY NUMERO1
            STOP RUN.
       END PROGRAM Tesst.

