       identification division.
       PROGRAM-ID. TEST.
       author GUTZ.
       date-written "16/06/2024".
       date-modified "16/06/2024".
       date-compiled "16/06/2024".
       installation "Empresa".
       security ""
       remarks "Este es un programa de prueba".
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hola Mundo en Cobol"
            STOP RUN.
       END PROGRAM TEST.
